app/controllers/application_controller.rb

  def records_update
    quantity = Quantity.find_by(id: params[:quantity][:id]) || Quantity.create(quantity: params[:quantity][:quantity])
    measure = Measure.find_by(id: params[:measure][:id]) || Measure.create(measure: params[:measure][:measure], divisible: params[:divisible])
    ingredient = Ingredient.find_by(id: params[:ingredient][:id]) || Ingredient.create(name: params[:ingredient][:name], preferred_measure: measure)

    if measure.divisible != params[:divisible]
      measure.divisible = params[:divisible]
      measure.save
    end

    if ingredient.preferred_measure != measure
      ingredient.preferred_measure = measure
      ingredient.save
---
INSERT INTO "quantities" ("quantity", "created_at", "updated_at") VALUES (?, ?, ?)  [["quantity", "3"], ["created_at", "2020-10-05 05:41:36.934720"], ["updated_at", "2020-10-05 05:41:36.934720"]]
SELECT  "quantities".* FROM "quantities" WHERE "quantities"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
INSERT INTO "measures" ("measure", "created_at", "updated_at") VALUES (?, ?, ?)  [["measure", "new30"], ["created_at", "2020-10-04 23:18:11.836805"], ["updated_at", "2020-10-04 23:18:11.836805"]]
SELECT  "measures".* FROM "measures" WHERE "measures"."id" = ? LIMIT ?  [["id", 171], ["LIMIT", 1]]
INSERT INTO "ingredients" ("name", "preferred_measure_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Lemon Juice"], ["preferred_measure_id", 169], ["created_at", "2020-10-05 10:48:34.793336"], ["updated_at", "2020-10-05 10:48:34.793336"]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 281], ["LIMIT", 1]]
UPDATE "ingredients" SET "preferred_measure_id" = ?, "updated_at" = ? WHERE "ingredients"."id" = ?  [["preferred_measure_id", 166], ["updated_at", "2020-10-04 23:21:02.769822"], ["id", 281]]